20250913T201504--kdoc-461-vpcのipアドレス範囲が16から28なのはなぜか__permanent.org
:properties:
:ID: 20250913T201504
:mtime:    20250914160851
:ctime:    20250913201506
:end:
#+title:      KDOC 461: VPCのIPアドレス範囲が/16から/28なのはなぜか?
#+date:       [2025-09-13 Sat 20:15]
#+filetags:   :permanent:
#+identifier: 20250913T201504

* この文書のステータス
- 作成
  - [X] 2025-09-14 貴島
- レビュー
  - [X] 2025-10-26 貴島

* 概要

AWS VPC(IPv4)のサブネットに指定可能な範囲は /16 から /28 である。IPv6の場合は /44 から /60 である。

[[https://docs.aws.amazon.com/ja_jp/vpc/latest/userguide/subnet-sizing.html][サブネット CIDR ブロック - Amazon Virtual Private Cloud]]

サブネットに親しみがなく、スケール感がわからない。現実的に実用として、サブネットが一定の範囲に収まるのはわかるのだが、AWSがこの値の範囲を指定している根拠は何だろうか。

サポートするサブネットの範囲が運用コストに関係する、などあるだろうか。

* 関連

なし。
