20250913T201504--kdoc-461-vpcのipアドレス範囲が16から28なのはなぜか__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:33:20Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 461: VPCのIPアドレス範囲が/16から/28なのはなぜか?</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 461: VPCのIPアドレス範囲が/16から/28なのはなぜか?</h1>
<div id="outline-container-org8a5fdd5" class="outline-2">
<h2 id="org8a5fdd5"><a href="#org8a5fdd5">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org8a5fdd5">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-09-14 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-10-26 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb1762b5" class="outline-2">
<h2 id="orgb1762b5"><a href="#orgb1762b5">概要</a></h2>
<div class="outline-text-2" id="text-orgb1762b5">
<p>
AWS VPC(IPv4)のサブネットに指定可能な範囲は /16 から /28 である。IPv6の場合は /44 から /60 である。
</p>

<p>
<a href="https://docs.aws.amazon.com/ja_jp/vpc/latest/userguide/subnet-sizing.html">サブネット CIDR ブロック - Amazon Virtual Private Cloud</a>
</p>

<p>
サブネットに親しみがなく、スケール感がわからない。現実的に実用として、サブネットが一定の範囲に収まるのはわかるのだが、AWSがこの値の範囲を指定している根拠は何だろうか。
</p>

<p>
サポートするサブネットの範囲が運用コストに関係する、などあるだろうか。
</p>
</div>
</div>
<div id="outline-container-org4e0c496" class="outline-2">
<h2 id="org4e0c496"><a href="#org4e0c496">関連</a></h2>
<div class="outline-text-2" id="text-org4e0c496">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
